<a href="https://colab.research.google.com/github/deepiskp-99/DSA_Python_CaseStudy/blob/main/Pandas_CaseStudy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.Load the Titanic dataset and display the first 10 rows.

In [1]:
import seaborn as sns
data = sns.load_dataset("titanic")

sns.get_dataset_names()
data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

2. Find the number of missing values in each column.

In [2]:
import seaborn as sns
data = sns.load_dataset("titanic")

missing_values = data.isnull().sum()

print(missing_values)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

3. Find the percentage of passengers who survived, grouped by gender.

In [3]:
survival_by_gender = data.groupby("sex")["survived"].mean() * 100

print(survival_by_gender)

sex
female    74.203822
male      18.890815
Name: survived, dtype: float64

4. Find the average, median, and standard deviation of passenger ages.

In [4]:
print("Average:", data["age"].mean())
print("Median:", data["age"].median())
print("Std Dev:", data["age"].std())

Average: 29.69911764705882
Median: 28.0
Std Dev: 14.526497332334044

5. Count how many passengers were in each class (pclass).

In [5]:
print(data["pclass"].value_counts())

pclass
3    491
1    216
2    184
Name: count, dtype: int64

6. Show all passengers who were female, under age 18, and survived.

In [6]:
import seaborn as sns

# Load dataset
titanic = sns.load_dataset("titanic")

# Filter: female, under 18, survived
subset = data[(data["sex"] == "female") &
                 (data["age"] < 18) &
                 (data["survived"] == 1)]

print(subset[["sex", "age", "pclass", "fare", "embark_town", "alive"]])

        sex    age  pclass      fare  embark_town alive
9    female  14.00       2   30.0708    Cherbourg   yes
10   female   4.00       3   16.7000  Southampton   yes
22   female  15.00       3    8.0292   Queenstown   yes
39   female  14.00       3   11.2417    Cherbourg   yes
43   female   3.00       2   41.5792    Cherbourg   yes
58   female   5.00       2   27.7500  Southampton   yes
68   female  17.00       3    7.9250  Southampton   yes
84   female  17.00       2   10.5000  Southampton   yes
156  female  16.00       3    7.7333   Queenstown   yes
172  female   1.00       3   11.1333  Southampton   yes
184  female   4.00       3   22.0250  Southampton   yes
208  female  16.00       3    7.7500   Queenstown   yes
233  female   5.00       3   31.3875  Southampton   yes
237  female   8.00       2   26.2500  Southampton   yes
307  female  17.00       1  108.9000    Cherbourg   yes
329  female  16.00       1   57.9792    Cherbourg   yes
381  female   1.00       3   15.7417    Cherbourg   yes
389  female  17.00       2   12.0000    Cherbourg   yes
435  female  14.00       1  120.0000  Southampton   yes
446  female  13.00       2   19.5000  Southampton   yes
448  female   5.00       3   19.2583    Cherbourg   yes
469  female   0.75       3   19.2583    Cherbourg   yes
479  female   2.00       3   12.2875  Southampton   yes
504  female  16.00       1   86.5000  Southampton   yes
530  female   2.00       2   26.0000  Southampton   yes
535  female   7.00       2   26.2500  Southampton   yes
618  female   4.00       2   39.0000  Southampton   yes
644  female   0.75       3   19.2583    Cherbourg   yes
689  female  15.00       1  211.3375  Southampton   yes
691  female   4.00       3   13.4167    Cherbourg   yes
720  female   6.00       2   33.0000  Southampton   yes
750  female   4.00       2   23.0000  Southampton   yes
777  female   5.00       3   12.4750  Southampton   yes
780  female  13.00       3    7.2292    Cherbourg   yes
781  female  17.00       1   57.0000  Southampton   yes
830  female  15.00       3   14.4542    Cherbourg   yes
853  female  16.00       1   39.4000  Southampton   yes
875  female  15.00       3    7.2250    Cherbourg   yes

7. Replace missing age values with the median age.

In [9]:
median_age = data["age"].median()
print(median_age)

data["age"] = data["age"].fillna(median_age)

print(data["age"].isna().sum())

28.0
0

8. Create a column age_group with values:
a. 'Child' for age < 18
b. 'Adult' for age 18–60
c. 'Senior' for age > 60
d. Use: apply() or np.where() or custom function

In [10]:
import seaborn as sns
import numpy as np
data = sns.load_dataset("titanic")


data["age"] = data["age"].fillna(data["age"].median())


data["age_group"] = np.where(data["age"] < 18, "Child",
                        np.where(data["age"] <= 60, "Adult", "Senior"))


print(data[["age", "age_group"]].head(15))

     age age_group
0   22.0     Adult
1   38.0     Adult
2   26.0     Adult
3   35.0     Adult
4   35.0     Adult
5   28.0     Adult
6   54.0     Adult
7    2.0     Child
8   27.0     Adult
9   14.0     Child
10   4.0     Child
11  58.0     Adult
12  20.0     Adult
13  39.0     Adult
14  14.0     Child

9. Display the top 5 passengers who paid the highest fare.

In [11]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

top5 = titanic.sort_values(by="fare", ascending=False).head(5)

print(top5[["sex", "age", "pclass", "fare", "embark_town", "alive"]])

        sex   age  pclass      fare  embark_town alive
679    male  36.0       1  512.3292    Cherbourg   yes
258  female  35.0       1  512.3292    Cherbourg   yes
737    male  35.0       1  512.3292    Cherbourg   yes
88   female  23.0       1  263.0000  Southampton   yes
438    male  64.0       1  263.0000  Southampton    no

10. Find the average fare paid, grouped by both pclass and sex

In [12]:
avg_fare = data.groupby(["pclass", "sex"])["fare"].mean()
print(avg_fare)

pclass  sex
1       female    106.125798
        male       67.226127
2       female     21.970121
        male       19.741782
3       female     16.118810
        male       12.661633
Name: fare, dtype: float64

11. Rename the following columns:
a. 'sex' → 'gender'
b. 'fare' → 'ticket_fare'

In [13]:
titanic = data.rename(columns={
    "sex": "gender",
    "fare": "ticket_fare"
})
print(data.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'age_group'],
      dtype='object')

12. Count the number of passengers who survived and didn’t survive, grouped by class.

In [14]:
survival_counts = data.groupby("pclass")["survived"].value_counts()
print(survival_counts)

pclass  survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: count, dtype: int64

13. Find the average age of passengers grouped by both class and gender.

In [15]:
avg_age = data.groupby(["pclass", "sex"])["age"].mean()
print(avg_age)

pclass  sex
1       female    33.978723
        male      38.995246
2       female    28.703947
        male      30.512315
3       female    23.572917
        male      26.911873
Name: age, dtype: float64